<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head>
  
  <meta content="text/html; charset=Windows-1251" http-equiv="content-type">
  <title>&#1058;&#1080;&#1087;&#1099; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1081; &#1085;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;</title>

  
</head><body>
<h1>&#1058;&#1080;&#1087;&#1099; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1081; &#1085;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;</h1>

&#1050;&#1072;&#1078;&#1076;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1086;&#1085;&#1085;&#1099;&#1084; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1077;&#1084;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1086;&#1073;&#1075;&#1086;&#1074;&#1072;&#1088;&#1080;&#1074;&#1072;&#1077;&#1090; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1051;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1086;&#1085;&#1085;&#1086;&#1077; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1077;
&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; &#1089; &#1102;&#1088;&#1080;&#1076;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1074;&#1077;&#1089;&#1086;&#1084;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091;
&#1042;&#1099; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1072;&#1077;&#1090;&#1077;&#1089;&#1100; &#1089; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103;&#1084;&#1080; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1086;&#1085;&#1085;&#1086;&#1075;&#1086; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1103;,
&#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1086; &#1085;&#1077; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1083;&#1086;&#1089;&#1100; &#1087;&#1088;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1077;.<br>

<br>

&#1058;&#1080;&#1087;&#1099; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1081; &#1085;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1076;&#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1085;&#1072;:<br>
<ul>
  <li>
&#1055;&#1083;&#1072;&#1090;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;;</li>
  <li>
&#1059;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086;-&#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;;</li>
  <li>
&#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;-&#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1077;&#1084;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;.</li>
</ul>

<br>

<table style="margin: 1px; font-size: 13px; font-family: &quot;Lucida Grande&quot;,&quot;Lucida Sans Unicode&quot;,Arial,Helvetica,sans-serif; font-weight: normal; font-style: normal; text-align: justify; line-height: 16.25px; border-collapse: collapse; color: rgb(31, 38, 40); letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(235, 238, 240);" border="0">

  <tbody>
    <tr>
      <td colspan="3" style="padding: 2px; vertical-align: top; text-align: center;"><strong>&#1051;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1080;
&#1085;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;</strong></td>
    </tr>
    <tr>
      <td><strong>&#1055;&#1083;&#1072;&#1090;&#1085;&#1086;&#1077;</strong></td>
      <td><strong>&#1059;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086;-&#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;&#1077;</strong></td>
      <td><strong>&#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;-&#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1077;&#1084;&#1086;&#1077;</strong></td>
    </tr>
    <tr>
      <td>Shareware</td>
      <td>Abandonware&nbsp;</td>
      <td>Free
software&nbsp;</td>
    </tr>
    <tr>
      <td>Commercial
software</td>
      <td>Adware&nbsp;</td>
      <td>GNU
GPL &nbsp;</td>
    </tr>
    <tr>
      <td>Crippleware&nbsp;</td>
      <td>Beerware&nbsp;</td>
      <td>BSD&nbsp;</td>
    </tr>
    <tr>
      <td>Hostageware&nbsp;</td>
      <td>Betaware&nbsp;</td>
      <td>MIT&nbsp;</td>
    </tr>
    <tr>
      <td>Nagware&nbsp;</td>
      <td>CDware&nbsp;</td>
      <td>GNU
LGPL&nbsp;</td>
    </tr>
    <tr>
      <td>Trialware</td>
      <td>Freeware&nbsp;</td>
      <td>Open
source software&nbsp;</td>
    </tr>
    <tr>
      <td>Trial
&nbsp;</td>
      <td>Donateware</td>
      <td>Apache
License&nbsp;</td>
    </tr>
    <tr>
      <td>Demoware&nbsp;</td>
      <td>Donationware
&nbsp;</td>
      <td>Mozilla
public license</td>
    </tr>
    <tr>
      <td>Careware</td>
      <td>Linkware</td>
      <td>Academic
free license</td>
    </tr>
    <tr>
      <td>Charityware</td>
      <td>Liteware</td>
      <td>GNU
AGPL</td>
    </tr>
    <tr>
      <td>&nbsp;</td>
      <td>Postcardware</td>
      <td>Common
Public License</td>
    </tr>
    <tr>
      <td>&nbsp;</td>
      <td>Cardware</td>
      <td>Eclipse
Public License</td>
    </tr>
    <tr>
      <td>&nbsp;</td>
      <td>Proprietary
software</td>
      <td>Eiffel
Forum License&nbsp;</td>
    </tr>
    <tr>
      <td>&nbsp;</td>
      <td>Public
domain</td>
      <td>&nbsp;</td>
    </tr>
    <tr>
      <td>&nbsp;</td>
      <td>Registerware</td>
      <td>&nbsp;</td>
    </tr>
    <tr>
      <td>&nbsp;</td>
      <td>Requestware</td>
      <td>&nbsp;</td>
    </tr>
  </tbody>
</table>

<br>

&nbsp;&#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1080;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1090; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;-&#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1077;&#1084;&#1099;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1082;
&#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1080; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1099;&#1093;, &#1080; &#1074; &#1101;&#1090;&#1091; &#1078;&#1077; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1102; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090;
&#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086;-&#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1099;&#1077;. &#1069;&#1090;&#1086; &#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086;
&#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086;-&#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1080;
&#1078;&#1077;&#1089;&#1090;&#1082;&#1086;&#1084; &#1089;&#1086;&#1073;&#1083;&#1102;&#1076;&#1077;&#1085;&#1080;&#1080; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1081; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1086;&#1085;&#1085;&#1086;&#1075;&#1086; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1103;.<br>

<br>

&#1058;&#1072;&#1082;&#1078;&#1077; &#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1087;&#1088;&#1080;&#1095;&#1080;&#1089;&#1083;&#1103;&#1090;&#1100; &#1087;&#1083;&#1072;&#1090;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;
&#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1103;&#1084;. &#1054;&#1085;&#1080; &#1074;&#1089;&#1077; &#1090;&#1072;&#1082;&#1080; &#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1090; &#1086;&#1087;&#1083;&#1072;&#1090;&#1099; &#1076;&#1083;&#1103; &#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1085;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;.<br>

<br>

&#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;-&#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1077;&#1084;&#1099;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1101;&#1090;&#1086; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1103;, &#1080;
&#1087;&#1088;&#1080;&#1095;&#1080;&#1089;&#1083;&#1103;&#1090;&#1100; &#1077;&#1105; &#1082; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1085;&#1077;&#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1085;&#1086;. &#1055;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1093;
&#1085;&#1077; &#1086;&#1073;&#1088;&#1072;&#1097;&#1072;&#1103; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1103; &#1085;&#1072; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1086;&#1085;&#1085;&#1086;&#1077; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1077;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1086;&#1085;&#1080;
&#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1102;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080; &#1076;&#1086;&#1084;&#1072;, &#1080; &#1074; &#1086;&#1092;&#1080;&#1089;&#1077;. &#1054;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080;&#1084;&#1077;&#1102;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1072; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1080; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1102;.<br>

<br>
<span style="font-weight: bold;">
Public Domain </span>- &#1042; &#1101;&#1090;&#1091; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1102; &#1086;&#1090;&#1085;&#1086;&#1089;&#1103;&#1090; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;,
&#1072;&#1074;&#1090;&#1086;&#1088;&#1089;&#1082;&#1086;&#1077; &#1087;&#1088;&#1072;&#1074;&#1086; &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1080;&#1089;&#1090;&#1077;&#1082;&#1083;&#1086;. &#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1090;&#1085;&#1086;&#1089;&#1103;&#1090; Public Domain
(&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077; &#1076;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;) &#1082; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1084;&#1091; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1102;, &#1085;&#1086; &#1101;&#1090;&#1086;
&#1086;&#1096;&#1080;&#1073;&#1086;&#1095;&#1085;&#1086;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1076;&#1072;&#1085;&#1085;&#1072;&#1103; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1103; &#1089;&#1080;&#1083;&#1100;&#1085;&#1086; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1086;&#1090; &#1079;&#1072;&#1082;&#1086;&#1085;&#1086;&#1076;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1072;
&#1089;&#1090;&#1088;&#1072;&#1085;&#1099;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1080;&#1083;&#1080; &#1073;&#1099;&#1083;&#1072; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;. &#1050; &#1090;&#1086;&#1084;&#1091; &#1078;&#1077;,
&#1074; &#1090;&#1072;&#1082;&#1080;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1093; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1089;&#1090;&#1072;&#1088;&#1099;&#1077; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1086;&#1085;&#1085;&#1099;&#1077; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1103;, &#1074;
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1085;&#1077; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;,
&#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1077;&#1087;&#1088;&#1080;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080;.<br>

<br>

<span style="font-weight: bold;">Shareware</span> - &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1086;&#1087;&#1083;&#1072;&#1090;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077;
&#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1090;&#1100; &#1076;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1081; &#1087;&#1077;&#1088;&#1080;&#1086;&#1076;.<br>

<br>
<span style="font-weight: bold;">
Commercial software</span> (&#1082;&#1086;&#1084;&#1084;&#1077;&#1088;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;) - &#1048;&#1079;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086;
&#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1094;&#1077;&#1083;&#1100;&#1102; &#1082;&#1086;&#1084;&#1084;&#1077;&#1088;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1087;&#1088;&#1080;&#1073;&#1099;&#1083;&#1080;, &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1087;&#1091;&#1090;&#1077;&#1084; &#1087;&#1088;&#1086;&#1076;&#1072;&#1078;&#1080;
&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1074;.<br>

<br>
<span style="font-weight: bold;">
Crippleware</span> - &#1050;&#1083;&#1102;&#1095;&#1077;&#1074;&#1099;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1076;&#1086;
&#1087;&#1088;&#1080;&#1086;&#1073;&#1088;&#1077;&#1090;&#1077;&#1085;&#1080;&#1103; &#1082;&#1083;&#1102;&#1095;&#1072;.<br>

<br>

<span style="font-weight: bold;">Hostageware</span> - &#1048;&#1084;&#1077;&#1077;&#1090; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;, &#1080;&#1083;&#1080; &#1087;&#1086; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1091; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1081;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1072;&#1079;&#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086;&#1089;&#1083;&#1077; &#1086;&#1087;&#1083;&#1072;&#1090;&#1099;.<br>

<br>

<span style="font-weight: bold;">Nagware</span> - &#1053;&#1072;&#1074;&#1103;&#1079;&#1095;&#1080;&#1074;&#1099;&#1077; &#1085;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1085;&#1080;&#1103; &#1086; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1087;&#1083;&#1072;&#1090;&#1099;.<br>

<br>
<span style="font-weight: bold;">
Trialware, Trial, Demoware</span> - &#1044;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1072;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; &#1082;&#1086;&#1084;&#1084;&#1077;&#1088;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086;
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1080;&#1084;&#1077;&#1077;&#1090; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1080;&#1083;&#1080;
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;.<br>

<br>
<span style="font-weight: bold;">
Careware, Charityware</span> - &#1054;&#1087;&#1083;&#1072;&#1090;&#1072; &#1080;&#1076;&#1105;&#1090; &#1085;&#1072; &#1073;&#1083;&#1072;&#1075;&#1086;&#1090;&#1074;&#1086;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;.<br>

<br>

<span style="font-weight: bold;">Abandonware</span> - &#1059;&#1078;&#1077; &#1085;&#1077; &#1074;&#1099;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1087;&#1088;&#1086;&#1076;&#1072;&#1078;&#1091; &#1080; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;.<br>

<br>

<span style="font-weight: bold;">Adware</span> - &#1057; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;&#1084; &#1088;&#1077;&#1082;&#1083;&#1072;&#1084;&#1099;.<br>

<br>

<span style="font-weight: bold;">Beerware</span> - &#1056;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1077;&#1090; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1102; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091; &#1080;
&#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076;, &#1085;&#1086; &#1077;&#1089;&#1083;&#1080; &#1086;&#1085; &#1074;&#1089;&#1090;&#1088;&#1077;&#1090;&#1080;&#1090; &#1072;&#1074;&#1090;&#1086;&#1088;&#1072;, &#1090;&#1086; &#1086;&#1085; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1082;&#1091;&#1087;&#1080;&#1090;&#1100; &#1077;&#1084;&#1091;
&#1082;&#1088;&#1091;&#1078;&#1082;&#1091; &#1087;&#1080;&#1074;&#1072;.<br>

<br>

<span style="font-weight: bold;">Betaware</span> - &#1041;&#1077;&#1090;&#1072;-&#1074;&#1077;&#1088;&#1089;&#1080;&#1103;, &#1085;&#1072; &#1087;&#1077;&#1088;&#1080;&#1086;&#1076; &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1090;&#1100;&#1089;&#1103;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;.<br>

<br>

<span style="font-weight: bold;">CDware</span> - &#1056;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1088;&#1077;&#1082;&#1083;&#1072;&#1084;&#1085;&#1099;&#1093; &#1094;&#1077;&#1083;&#1103;&#1093; &#1085;&#1072; &#1082;&#1086;&#1084;&#1087;&#1072;&#1082;&#1090;-&#1076;&#1080;&#1089;&#1082;&#1072;&#1093;.<br>

<br>

<span style="font-weight: bold;">Freeware</span> - &#1052;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086; &#1087;&#1088;&#1080; &#1089;&#1086;&#1073;&#1083;&#1102;&#1076;&#1077;&#1085;&#1080;&#1080; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1081;
&#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1086;&#1085;&#1085;&#1086;&#1075;&#1086; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1103;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;&#1074; &#1074; &#1103;&#1074;&#1085;&#1086;&#1081; &#1092;&#1086;&#1088;&#1084;&#1077;
&#1079;&#1072;&#1087;&#1088;&#1077;&#1097;&#1077;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;.<br>

<br>
<span style="font-weight: bold;">
Donateware, Donationware</span> - &#1055;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;, &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1076;&#1072;&#1078;&#1077; &#1089;
&#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;, &#1085;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1099;&#1089;&#1082;&#1072;&#1082;&#1080;&#1074;&#1072;&#1090;&#1100; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1089;
&#1087;&#1088;&#1086;&#1089;&#1100;&#1073;&#1086;&#1081; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1087;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1072;&#1074;&#1090;&#1086;&#1088;&#1091;.<br>

<br>

<span style="font-weight: bold;">Linkware</span> - &#1040;&#1074;&#1090;&#1086;&#1088; &#1087;&#1088;&#1086;&#1089;&#1080;&#1090; &#1085;&#1072; &#1089;&#1074;&#1086;&#1080;&#1093; &#1089;&#1072;&#1081;&#1090;&#1072;&#1093; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1077;&#1075;&#1086; &#1089;&#1072;&#1081;&#1090;.<br>

<br>

<span style="font-weight: bold;">Liteware</span> - &#1050;&#1086;&#1084;&#1084;&#1077;&#1088;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090; &#1089; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1085;&#1099;&#1084; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1086;&#1084;.<br>

<br>
<span style="font-weight: bold;">
Postcardware, Cardware</span> - &#1052;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;, &#1085;&#1086; &#1072;&#1074;&#1090;&#1086;&#1088;
&#1087;&#1088;&#1086;&#1089;&#1080;&#1090; &#1074;&#1099;&#1089;&#1083;&#1072;&#1090;&#1100; &#1077;&#1084;&#1091; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1082;&#1091;.<br>

<br>
<span style="font-weight: bold;">
Proprietary software</span> (&#1055;&#1088;&#1086;&#1087;&#1088;&#1080;&#1077;&#1090;&#1072;&#1088;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;) - &#1071;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;
&#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1081; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;, &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103; &#1086;&#1073;&#1075;&#1086;&#1074;&#1072;&#1088;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1086;&#1085;&#1085;&#1086;&#1084;
&#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1080;.<br>

<br>

<span style="font-weight: bold;">Registerware</span> - &#1058;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1072;&#1085;&#1082;&#1077;&#1090;&#1091;.<br>

<br>

<span style="font-weight: bold;">Requestware</span> - &#1040;&#1074;&#1090;&#1086;&#1088; &#1087;&#1088;&#1086;&#1089;&#1080;&#1083; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1095;&#1090;&#1086;-&#1090;&#1086; &#1079;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;.<br>

<br>

&#1044;&#1083;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;-&#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1077;&#1084;&#1099;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1099;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;
&#1095;&#1090;&#1086; &#1074;&#1089;&#1077;&#1093; &#1080;&#1093; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080; &#1076;&#1086;&#1084;&#1072;, &#1080; &#1074; &#1086;&#1092;&#1080;&#1089;&#1077;.<br>

<br>
<span style="font-weight: bold;">
Free software </span>- &#1054;&#1073;&#1097;&#1080;&#1081; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;. &#1053;&#1086;
&#1080;&#1079;-&#1079;&#1072; &#1085;&#1077;&#1086;&#1076;&#1085;&#1086;&#1079;&#1085;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080; &#1089;&#1083;&#1086;&#1074;&#1072; Free &#1077;&#1075;&#1086; &#1087;&#1091;&#1090;&#1072;&#1102;&#1090; &#1089; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1099;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1084;
&#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1073;&#1099;&#1083;&#1086; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1086;&#1074;&#1072;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1081;&#1090;&#1080; &#1082; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1091; Open source
software.<br>

<br>
<span style="font-weight: bold;">
GNU GPL </span>- &#1057;&#1072;&#1084;&#1099;&#1081; &#1087;&#1086;&#1087;&#1091;&#1083;&#1103;&#1088;&#1085;&#1072;&#1103; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1103; &#1085;&#1072; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077;
&#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;. &#1056;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100; &#1080; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;.
 &#1055;&#1088;&#1080; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1074;
&#1076;&#1072;&#1083;&#1100;&#1085;&#1077;&#1081;&#1096;&#1077;&#1084; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090; &#1087;&#1086; &#1090;&#1086;&#1081; &#1078;&#1077; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1080;.<br>

<br>

<span style="font-weight: bold;">BSD</span> - &#1054;&#1073;&#1099;&#1095;&#1085;&#1086; &#1074; &#1090;&#1072;&#1082;&#1080;&#1093; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1103; &#1074;&#1089;&#1077;&#1075;&#1086; &#1090;&#1088;&#1080; &#1087;&#1091;&#1085;&#1082;&#1090;&#1072;. &#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1077;&#1090;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086; &#1080; &#1076;&#1086;&#1084;&#1072;, &#1080; &#1074; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;. &#1042;&#1090;&#1086;&#1088;&#1086;&#1081; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;,
&#1095;&#1090;&#1086; &#1076;&#1072;&#1078;&#1077; &#1087;&#1088;&#1080; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1072;&#1074;&#1090;&#1086;&#1088;&#1072; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081;
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;. &#1058;&#1088;&#1077;&#1090;&#1080;&#1081; &#1087;&#1091;&#1085;&#1082;&#1090; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1085;&#1080;&#1082;&#1072;&#1082;&#1080;&#1077; &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1080; &#1085;&#1077;
&#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;.<br>

<br>

<span style="font-weight: bold;">MIT</span> - &#1056;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1072;&#1093; &#1089; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084;, &#1087;&#1088;&#1080;
&#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1080; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1080; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1089; &#1101;&#1090;&#1086;&#1081;
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1086;&#1081;.<br>

<br>
<span style="font-weight: bold;">
GNU LGPL</span> - &#1056;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1072; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1082;&#1086;&#1084;&#1087;&#1088;&#1086;&#1084;&#1080;&#1089;&#1089;&#1072; &#1084;&#1077;&#1078;&#1076;&#1091; GNU GPL &#1080; &#1090;&#1072;&#1082;&#1080;&#1084;&#1080;
&#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1103;&#1084;&#1080; &#1082;&#1072;&#1082; BSD &#1080; MIT.<br>

<br>
<span style="font-weight: bold;">
Open source software</span> - &#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100;
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084;. &#1055;&#1088;&#1080; &#1095;&#1077;&#1084;, &#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084;
&#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1084;&#1072;&#1083;&#1086; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1082;&#1086;&#1076; &#1076;&#1083;&#1103; &#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1086;&#1085; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1076;&#1083;&#1103; &#1076;&#1086;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1087;&#1086;
&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1084; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1103;&#1084;. <br>

<br>
<span style="font-weight: bold;">
Apache License</span> - &#1056;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100;. &#1052;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1103;
&#1090;&#1072;&#1082;&#1078;&#1077; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1072;, &#1085;&#1086; &#1089; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1085;&#1077;&#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103;&#1084;&#1080;.
&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1086;&#1074; &#1082;&#1086;&#1084;&#1087;&#1072;&#1085;&#1080;&#1080; Apache Software Foundation.<br>

<br>
<span style="font-weight: bold;">
Mozilla Public License</span> - &#1051;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1103; &#1085;&#1072; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1055;&#1054;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1072;
Mozilla Foundation, &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1086;&#1074; &#1101;&#1090;&#1086;&#1081;
&#1082;&#1086;&#1084;&#1087;&#1072;&#1085;&#1080;&#1080;.<br>

<br>
<span style="font-weight: bold;">
Academic free license</span> - &#1051;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1103; &#1085;&#1072; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1055;&#1054;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1086;&#1103;&#1089;&#1085;&#1103;&#1077;&#1090;, &#1095;&#1090;&#1086;
&#1072;&#1074;&#1090;&#1086;&#1088;&#1089;&#1082;&#1080;&#1077; &#1087;&#1088;&#1072;&#1074;&#1072; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103;.<br>

<br>
<span style="font-weight: bold;">
GNU AGPL</span> - &#1048;&#1079;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1072; &#1076;&#1083;&#1103; &#1074;&#1077;&#1073;-&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;, &#1080; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1077;&#1090;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100; &#1080; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;.<br>

<br>
<span style="font-weight: bold;">
Common Public License</span> - &#1051;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1103; &#1085;&#1072; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1055;&#1054;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1072;
IBM.<br>

<br>
<span style="font-weight: bold;">
Eclipse Public License</span> - &#1051;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1103; &#1085;&#1072; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1077; &#1055;&#1054;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1072;
Eclipse Foundation, &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1089;&#1074;&#1086;&#1080;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1086;&#1074;.<br>

<br>
<span style="font-weight: bold;">
Eiffel Forum License</span> - &#1056;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100; &#1080;
&#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;. &#1053;&#1086; &#1072;&#1074;&#1090;&#1086;&#1088;&#1089;&#1082;&#1080;&#1077; &#1087;&#1088;&#1072;&#1074;&#1072; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1080; &#1090;&#1077;&#1082;&#1089;&#1090; &#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1080;
&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;, &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1055;&#1054;.<br>

<br>

</body></html>